*start

;------------------------------------------------------------------
*memori_4

#
ここはメモリの好感度が100以上で見れます[p]


[jump target="*relation_ship_end" ]
;------------------------------------------------------------------
*memori_3

#
ここはメモリの好感度が80以上で見れます[p]


[jump target="*relation_ship_end" ]
;------------------------------------------------------------------
*memori_2

#
ここはメモリの好感度が60以上で見れます[p]


[jump target="*relation_ship_end" ]
;------------------------------------------------------------------
*memori_1

#
ここはメモリの好感度が40以上で見れます[p]


[jump target="*relation_ship_end" ]
;------------------------------------------------------------------
*memori_0

#
ここはメモリの好感度が20以上で見れます[p]

[jump target="*relation_ship_end" ]
;------------------------------------------------------------------
*scout_4

#
ここはスカウトの好感度が100以上で見れます[p]


[jump target="*relation_ship_end" ]
;------------------------------------------------------------------
*scout_3

#
ここはスカウトの好感度が80以上で見れます[p]


[jump target="*relation_ship_end" ]
;------------------------------------------------------------------
*scout_2

#
ここはスカウトの好感度が60以上で見れます[p]


[jump target="*relation_ship_end" ]
;------------------------------------------------------------------
*scout_1

#
ここはスカウトの好感度が40以上で見れます[p]


[jump target="*relation_ship_end" ]
;------------------------------------------------------------------
*scout_0

#
ここはスカウトの好感度が20以上で見れます[p]


[jump target="*relation_ship_end" ]
;------------------------------------------------------------------
*relation_ship_end
[free layer="message0" name="chara_name_area"  ]
[clearfix]
[layopt layer="message0" visible="false"  ]
[chara_hide name="akane" time="1000" ]
[chara_hide name="yamato" time="1000" ]
[jump storage="logic.ks" ]
